In [10]:
import pandas as pd
sales_final=pd.read_csv('./data fsds/sales_data_final.csv')
sales_final.head()  # SHows topmost 5 data entries
sales_final.tail() # Shows buttommost 5 records
sales_final.columns # Shows all the columns
sales_final.order_date
sales_final[['order_date','year']] # If you want to fetch more than one row you have to do it like this. wrapping it under single square brackets throws you an error

       order_date  year
0        1/1/2011  2011
1        1/1/2011  2011
2        1/1/2011  2011
3        1/1/2011  2011
4        1/1/2011  2011
...           ...   ...
51285  12/31/2014  2014
51286  12/31/2014  2014
51287  12/31/2014  2014
51288  12/31/2014  2014
51289  12/31/2014  2014

[51290 rows x 2 columns]

In [12]:
print(sales_final['year'],sales_final[['year']])
print(type(sales_final['year']),type(sales_final[['year']]))

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
51285    2014
51286    2014
51287    2014
51288    2014
51289    2014
Name: year, Length: 51290, dtype: int64        year
0      2011
1      2011
2      2011
3      2011
4      2011
...     ...
51285  2014
51286  2014
51287  2014
51288  2014
51289  2014

[51290 rows x 1 columns]
<class 'pandas.core.series.Series'> <class 'pandas.core.frame.DataFrame'>

In [13]:
sales_final.describe() # Returns a df containing basic sstatistical analysis on the numeric columns

           quantity      discount        profit  shipping_cost          year
count  51290.000000  51290.000000  51290.000000   51290.000000  51290.000000
mean       3.476545      0.142908     28.641740      26.375915   2012.777208
std        2.278766      0.212280    174.424113      57.296804      1.098931
min        1.000000      0.000000  -6599.978000       0.000000   2011.000000
25%        2.000000      0.000000      0.000000       2.610000   2012.000000
50%        3.000000      0.000000      9.240000       7.790000   2013.000000
75%        5.000000      0.200000     36.810000      24.450000   2014.000000
max       14.000000      0.850000   8399.976000     933.570000   2014.000000

In [14]:
sales_final.dtypes

order_id           object
order_date         object
ship_date          object
ship_mode          object
customer_name      object
segment            object
state              object
country            object
market             object
region             object
product_id         object
category           object
sub_category       object
product_name       object
sales              object
quantity            int64
discount          float64
profit            float64
shipping_cost     float64
order_priority     object
year                int64
dtype: object

In [15]:
sales_final.dtypes=='object'

order_id           True
order_date         True
ship_date          True
ship_mode          True
customer_name      True
segment            True
state              True
country            True
market             True
region             True
product_id         True
category           True
sub_category       True
product_name       True
sales              True
quantity          False
discount          False
profit            False
shipping_cost     False
order_priority     True
year              False
dtype: bool

In [16]:
sales_final.dtypes[sales_final.dtypes=='object']

order_id          object
order_date        object
ship_date         object
ship_mode         object
customer_name     object
segment           object
state             object
country           object
market            object
region            object
product_id        object
category          object
sub_category      object
product_name      object
sales             object
order_priority    object
dtype: object

In [19]:
sales_final[sales_final.dtypes[sales_final.dtypes=='object'].index].describe()

,order_id,order_date,ship_date,ship_mode,customer_name,segment,state,country,market,region,product_id,category,sub_category,product_name,sales,order_priority
count,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290,51290
unique,25035,1430,1464,4,795,3,1094,147,7,13,10292,3,17,3788,2246,4
top,CA-2014-100111,6/18/2014,11/22/2014,Standard Class,Muhammed Yedwab,Consumer,California,United States,APAC,Central,OFF-AR-10003651,Office Supplies,Binders,Staples,13,Medium
freq,14,135,130,30775,108,26518,2001,9994,11002,11117,35,31273,6152,227,589,29433

In [25]:
sales_final[sales_final.dtypes[sales_final.dtypes=='float64'].index].describe()

           discount        profit  shipping_cost
count  51290.000000  51290.000000   51290.000000
mean       0.142908     28.641740      26.375915
std        0.212280    174.424113      57.296804
min        0.000000  -6599.978000       0.000000
25%        0.000000      0.000000       2.610000
50%        0.000000      9.240000       7.790000
75%        0.200000     36.810000      24.450000
max        0.850000   8399.976000     933.570000

In [26]:
sales_final['category2']='Trial'
# This way you can add new columns

In [38]:
sales_final['converted_date']=pd.to_datetime(sales_final['order_date'])
sales_final['converted_date'].dt.year

0        2011
1        2011
2        2011
3        2011
4        2011
         ...
51285    2014
51286    2014
51287    2014
51288    2014
51289    2014
Name: converted_date, Length: 51290, dtype: int64

In [34]:
# Find the most profitable customer
sales_final[sales_final['profit']==sales_final['profit'].max()]['customer_name']

29530    Tamara Chand
Name: customer_name, dtype: object

In [1]:
print('hell')

hell